#### Reference Members

---

|  |
| --- |
| Reference Class   Constructors   Methods   Properties   See Also |

The  Reference  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | Reference | Creates a Reference with the supplied element. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Contains | Checks if given reference identifies part of object identified by this reference. |
| Public method | ConvertToStableRepresentation | Converts the reference to a stable String representation. |
| Public method | CreateLinkReference | Creates a Reference from a Reference in an RVT Link. |
| Public method | CreateReferenceInLink | Creates a Reference in an RVT Link from a Reference in the RVT host file. |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | EqualTo | Checks if given reference is equal to this reference. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | ParseFromStableRepresentation | Converts a stable String representation of a reference to a Reference object. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ElementId | The element id for this reference. |
| Public property | ElementReferenceType | The type of reference. |
| Public property | GlobalPoint | The position on which the reference is hit. |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |
| Public property | LinkedElementId | The id of the top-level element in the linked document that is referred to by this reference. |
| Public property | UVPoint | The UV parameters of the reference, if the reference contains a face. |

# See Also

Reference Class

Autodesk.Revit.DB Namespace